DataProcessors/гф_ГрупповаяУстановкаБлокировок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<DataProcessor>
		<Properties>
			<Name>гф_ГрупповаяУстановкаБлокировок</Name>
			<Comment>// #wortmann #4.1.15 (Рабочее место по дебет-менеджменту) Галфинд(Просто) Боцманова 2022/09/05</Comment>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Блокировка</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоговорКонтрагента</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидБлокировки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.гф_ВидыБлокировок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заблокирован</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Исключения</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Согласовано</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДействуетДо</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ответственный</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Флаг</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партнер</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/гф_ПричиныБлокировок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<InformationRegister>
		<Properties>
			<Name>гф_ПричиныБлокировок</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Заблокирован</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидБлокировки</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.гф_ВидыБлокировок</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/гф_БлокировкаРазблокировкаОтгрузок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Document>
		<Properties>
			<Name>гф_БлокировкаРазблокировкаОтгрузок</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидБлокировки</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.гф_ВидыБлокировок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заблокирован</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исключения</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Согласовано</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДействуетДо</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:DocumentRef.гф_БлокировкаРазблокировкаОтгрузок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

DataProcessors/гф_ГрупповаяУстановкаБлокировок/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиКомандФормы

// #wortmann {
// #Груповая установка блокировок
// Галфинд(Просто) Боцманова 2022/09/09
// Отмечает все строки
&НаКлиенте
Процедура КомандаОтметитьВсе(Команда)
	
	Для Каждого Строка Из Объект.Блокировка Цикл
		
		Строка.Флаг = Истина;	
		
	КонецЦикла;
	
КонецПроцедуры
// } #wortmann

// #wortmann {
// #Груповая установка блокировок
// Галфинд(Просто) Боцманова 2022/09/09
// Снимает все отметки
//
&НаКлиенте
Процедура КомандаСнятьВсеОтметки(Команда)
	
	Для Каждого Строка Из Объект.Блокировка Цикл
		
		Строка.Флаг = Ложь;	
		
	КонецЦикла;
	
КонецПроцедуры
// } #wortmann

// #wortmann {
// #Груповая установка блокировок
// Галфинд(Просто) Боцманова 2022/09/09
// Заполняет данными из регистра причины блокировок ,где звблокирован равно истина и на дату указанную в обработке
//
&НаСервере
Процедура ЗаполнитьЗаблокированнымиНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	гф_ПричиныБлокировокСрезПоследних.Контрагент КАК Контрагент,
		|	гф_ПричиныБлокировокСрезПоследних.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|	гф_ПричиныБлокировокСрезПоследних.ВидБлокировки КАК ВидБлокировки,
		|	гф_ПричиныБлокировокСрезПоследних.Заблокирован КАК Заблокирован
		|ИЗ
		|	РегистрСведений.гф_ПричиныБлокировок.СрезПоследних(&Дата, Заблокирован = ИСТИНА) КАК гф_ПричиныБлокировокСрезПоследних"; 
	Запрос.УстановитьПараметр("Дата", КонецДня(Дата));
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	Объект.Блокировка.Загрузить(РезультатЗапроса);
КонецПроцедуры
// } #wortmann

// #wortmann {
// #Груповая установка блокировок
// Галфинд(Просто) Боцманова 2022/09/09
//
&НаКлиенте
Процедура ЗаполнитьЗаблокированными(Команда)
	ЗаполнитьЗаблокированнымиНаСервере();
КонецПроцедуры
// } #wortmann 

// #wortmann {
// Галфинд(Просто) Боцманова 2022/09/09
&НаСервере
Процедура УстановитьЗначенияНаСервере()
КонецПроцедуры
// } #wortmann

// #wortmann {
// Галфинд(Просто) Боцманова 2022/09/09
//
// Параметры:
//
// Команда - команда формы
&НаКлиенте
Процедура УстановитьЗначения(Команда) 
	УстановитьЗначенияНаСервере();
КонецПроцедуры

// #wortmann {
// #Груповая установка блокировок
// Галфинд(Просто) Боцманова 2022/09/09
//
&НаСервере
Процедура ВыполнитьНаСервере()
	
	Для Каждого стр Из объект.Блокировка Цикл
		Если стр.Флаг Тогда
			ПроверкаНаУникальностьЗаписейПоПериоду(стр.Контрагент, стр.ДоговорКонтрагента, стр.ВидБлокировки); 
			Документ = Документы.гф_БлокировкаРазблокировкаОтгрузок.СоздатьДокумент(); 
			ЗаполнитьЗначенияСвойств(Документ, стр);
			Документ.Дата = Дата;
			Документ.Ответственный = Пользователи.ТекущийПользователь();
			Документ.Комментарий = "Создано обработкой Групповая установка блокировок.";
			Документ.Записать(РежимЗаписиДокумента.Проведение);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// #wortmann {
// #Групповое содание документов на основе текущих данных
// Галфинд(Просто) Боцманова 2022/09/09
//
&НаКлиенте
Процедура ВыполнитьОперацию(Команда)
	ВыполнитьНаСервере();
КонецПроцедуры
// } #wortmann 

// #wortmann {
// #Проверяет на уникальность по периоду у регистра,в случае нахождения,идет перезапись и вывод сообщения
// Галфинд(Просто) Боцманова 2022/09/09
//
&НаСервере
Процедура ПроверкаНаУникальностьЗаписейПоПериоду(Контрагент, ДоговорКонтрагента, ВидБлокировки)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	гф_ПричиныБлокировок.Регистратор КАК Регистратор
		|ИЗ
		|	РегистрСведений.гф_ПричиныБлокировок КАК гф_ПричиныБлокировок
		|ГДЕ
		|	гф_ПричиныБлокировок.Период = &Период";
	
	Запрос.УстановитьПараметр("Период", Дата);

	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		НаборЗаписей = РегистрыСведений.гф_ПричиныБлокировок.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(Выборка.Регистратор, Истина); 
		НаборЗаписей.Прочитать();
		Если Не НаборЗаписей.Количество() = 0 Тогда
			СуществующаяЗапись = НаборЗаписей[0];
			СуществующаяЗапись.Период = СуществующаяЗапись.Период-1;
			НаборЗаписей.Записать();
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтрШаблон("Внимание! По %1 %2 была запись на «%3»",
			СуществующаяЗапись.Контрагент, СуществующаяЗапись.ДоговорКонтрагента, Дата);
			Сообщение.Сообщить();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
// } #wortmann

// #wortmann {
// #Загрузка данных из файла
// Галфинд(Просто) Боцманова 2022/09/09
//
&НаКлиенте
Процедура ЗагрузкаДанныхИзТабличногоДокумента(Команда)
	
	ПараметрыЗагрузки = ЗагрузкаДанныхИзФайлаКлиент.ПараметрыЗагрузкиДанных();
	ПараметрыЗагрузки.ПолноеИмяТабличнойЧасти = "Обработка.гф_ГрупповаяУстановкаБлокировок.Блокировка";
	ПараметрыЗагрузки.Заголовок = НСтр("ru = 'Загрузка из файла';
										|en = 'Import from file'");
	Оповещение = Новый ОписаниеОповещения("ЗагрузитьИзФайлаЗавершение", ЭтотОбъект);
	ЗагрузкаДанныхИзФайлаКлиент.ПоказатьФормуЗагрузки(ПараметрыЗагрузки, Оповещение);
	
КонецПроцедуры
// } #wortmann

// #wortmann {
// #Загрузка данных из файла
// Галфинд(Просто) Боцманова 2022/09/09
//

&НаКлиенте
Процедура ЗагрузитьИзФайлаЗавершение(АдресЗагруженныхДанных, ДополнительныеПараметры) Экспорт
	
	Если АдресЗагруженныхДанных = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	ЗагрузитьИзФайлаНаСервере(АдресЗагруженныхДанных);
	
КонецПроцедуры
// } #wortmann 

// #wortmann {
// #Загрузка данных из файла
// Галфинд(Просто) Боцманова 2022/09/09
//
&НаСервере
Процедура ЗагрузитьИзФайлаНаСервере(АдресЗагруженныхДанных)
	
	ЗагруженныеДанные = ПолучитьИзВременногоХранилища(АдресЗагруженныхДанных);
	
	Для каждого СтрокаТаблицы Из ЗагруженныеДанные Цикл 
	
		Если Не ЗначениеЗаполнено(СтрокаТаблицы.Контрагент) Тогда 
			Продолжить;
		КонецЕсли;
	
		НоваяСтрока = Объект.Блокировка.Добавить();
		НоваяСтрока.Флаг = СтрокаТаблицы.Флаг;
		НоваяСтрока.Контрагент = СтрокаТаблицы.Контрагент;
		НоваяСтрока.ДоговорКонтрагента = СтрокаТаблицы.ДоговорКонтрагента;
		НоваяСтрока.ВидБлокировки = СтрокаТаблицы.ВидБлокировки;
		НоваяСтрока.Заблокирован = СтрокаТаблицы.Заблокирован;
		НоваяСтрока.Комментарий = СтрокаТаблицы.Комментарий;
		
	КонецЦикла;
	
КонецПроцедуры
// } #wortmann

#КонецОбласти
